TSD_TK/src/Catalogs/ТипыДокументов/ТипыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыДокументов</name>
  <predefined>
    <items>
      <name>БезакцептныйПрием</name>
      <description>Безакцептне приймання</description>
    </items>
    <items>
      <name>БезакцептныйПриемPKG</name>
      <description>Безакцептный Прием PKG</description>
    </items>
    <items>
      <name>ВыдачаДС</name>
      <description>Видача ДС</description>
    </items>
    <items>
      <name>ЗаданиеИН</name>
      <description>Завдання інв-ція</description>
    </items>
    <items>
      <name>Задание</name>
      <description>Задание</description>
    </items>
    <items>
      <name>ЗаданиеВФ</name>
      <description>Задание Верификация</description>
    </items>
    <items>
      <name>Zak</name>
      <description>Замовлення</description>
    </items>
    <items>
      <name>Заявка</name>
      <description>Заявка</description>
    </items>
    <items>
      <name>Инвентаризация</name>
      <description>Инвентаризация</description>
    </items>
    <items>
      <name>ИнвентаризацияТБД</name>
      <description>Инвентаризация ТБД</description>
    </items>
    <items>
      <name>Комплектация</name>
      <description>Комплектация</description>
    </items>
    <items>
      <name>Контролер</name>
      <description>Контролер</description>
    </items>
    <items>
      <name>ЛокальнаяИнвентаризация</name>
      <description>Локальная инвентаризация</description>
    </items>
    <items>
      <name>МаршрутныйЛист</name>
      <description>Маршрутный лист</description>
    </items>
    <items>
      <name>ЗаданиеТБД</name>
      <description>Не продається</description>
    </items>
    <items>
      <name>ПроверкаСтандартов</name>
      <description>Перевірка стандартів</description>
    </items>
    <items>
      <name>ПеремещениеТоваров</name>
      <description>Перемещение товаров</description>
    </items>
    <items>
      <name>ВозвратПеремещение</name>
      <description>Переміщення (логістика)</description>
    </items>
    <items>
      <name>Переоценки</name>
      <description>Переоценки</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортиця</description>
    </items>
    <items>
      <name>Печать</name>
      <description>Печать</description>
    </items>
    <items>
      <name>ВозвратТоваров</name>
      <description>Повернення постачальнику</description>
    </items>
    <items>
      <name>Посетители</name>
      <description>Посетители</description>
    </items>
    <items>
      <name>ПриемПоЗаказу</name>
      <description>Поступление товаров</description>
    </items>
    <items>
      <name>ПриемPKG</name>
      <description>Прием PKG</description>
    </items>
    <items>
      <name>ПриемПоПриходу</name>
      <description>Прием по приходу</description>
    </items>
    <items>
      <name>ПриходУход</name>
      <description>Приход уход</description>
    </items>
    <items>
      <name>Рекламация</name>
      <description>Рекламация</description>
    </items>
    <items>
      <name>Списание2</name>
      <description>Списание</description>
    </items>
    <items>
      <name>ЗаданиеТНП</name>
      <description>Термін придатності</description>
    </items>
    <items>
      <name>Уведомление</name>
      <description>Уведомление</description>
    </items>
    <items>
      <name>Уценка</name>
      <description>Уценка</description>
    </items>
    <items>
      <name>Фото</name>
      <description>Фото</description>
    </items>
    <items>
      <name>ФотоСчетчика</name>
      <description>Фото счетчика</description>
    </items>
  </predefined>
</mdclass:Catalog>

TSD_TK/src/CommonForms/РедактированиеСтрокиV2/Module.bsl
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт

КонецПроцедуры

// Возникает при сканировании внутренней камерой устройства
//
&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт

    Возврат;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()

    ТипДокумента        = Параметры.ТипДокумента;
    ИдентификаторСтроки = Параметры.ИдентификаторСтроки;
    Если Параметры.Свойство("НомерСтроки") Тогда
        НомерСтроки = Параметры.НомерСтроки;
    КонецЕсли;

    Если Параметры.Свойство("ИспМРЦ") Тогда
        ИспМРЦ = Параметры.ИспМРЦ;
    КонецЕсли;
    Если Параметры.Свойство("ХозОперация") Тогда
        ХозОперация = Параметры.ХозОперация;
    КонецЕсли;
    Если Параметры.Свойство("НаименованиеТовара") Тогда
        Если Параметры.Свойство("НаименованиеЕдиницы") Тогда
            НаименованиеТовара = Параметры.НаименованиеТовара + " " + Параметры.НаименованиеЕдиницы + " " + ?(ИспМРЦ,
                " МРЦ - " + Параметры.МРЦ, "");
        Иначе
            НаименованиеТовара = Параметры.НаименованиеТовара + ?(ИспМРЦ, " МРЦ - " + Параметры.МРЦ, "");
        КонецЕсли;
    КонецЕсли;
	
	//Если Параметры.Свойство("НаименованиеЕдиницы") Тогда
	//	НаименованиеЕдиницы = Параметры.НаименованиеЕдиницы;
	//КонецЕсли;

    Если Параметры.Свойство("Количество") Тогда
        Количество = Параметры.Количество;
    КонецЕсли;
    Если Параметры.Свойство("Весовой") Тогда
        Весовой = Параметры.Весовой;
    КонецЕсли;
    Если Параметры.Свойство("ПриемДо") Тогда
        ПриемДо = Параметры.ПриемДо;
    КонецЕсли;
    Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица") Тогда
        КоличествоВведено = Параметры.КоличествоВведено;
        НаименованиеТовара2 = Параметры.НаименованиеТовара2;
        КофПересорт = Параметры.КоличествоПоставщика;

    Иначе
        Если Параметры.Свойство("КоличествоВведено") Тогда
            Количество = Параметры.КоличествоВведено;
        КонецЕсли;
    КонецЕсли;
    Коэффициент = 1;
    Если Параметры.Свойство("Коэффициент") Тогда
        Коэффициент = Параметры.Коэффициент;
        Если ТипЗнч(Коэффициент) = Тип("Число") Тогда
            Коэффициент =?(Коэффициент = 0, 1, Коэффициент);
        Иначе
            Коэффициент = 1;
        КонецЕсли;
        Количество = Количество / Коэффициент;
    КонецЕсли;
    Если Параметры.Свойство("КоличествоПоставщика") Тогда
        КоличествоОжидаемое  = Параметры.КоличествоПоставщика / Коэффициент;
    КонецЕсли;

    Если Параметры.Свойство("Остаток") Тогда
        Остаток = Параметры.Остаток;
    КонецЕсли;

    Если Параметры.Свойство("Продажи") Тогда
        Продажи = Параметры.Продажи;
    КонецЕсли;

    Если Параметры.Свойство("СканированиеТовар") Тогда
        СканированиеТовар = Параметры.СканированиеТовар;
    КонецЕсли;
    Если Параметры.Свойство("СканированиеЦенник") Тогда
        СканированиеЦенник = Параметры.СканированиеЦенник;
    КонецЕсли;

    Если ТипДокумента = Справочники.ТипыДокументов.ЗаданиеИН Или ТипДокумента = Справочники.ТипыДокументов.Инвентаризация
        Или ТипДокумента = Справочники.ТипыДокументов.ЛокальнаяИнвентаризация Или ТипДокумента
        = Справочники.ТипыДокументов.ЗаданиеТБД Тогда
        зМРЦ = ?(ЗначениеЗаполнено(Параметры.МРЦ), Параметры.МРЦ, 0);
        РезОтвет = ИнтеграцияТК_ВызовСервера.ПолучитьОстатокТовара(Параметры.Артикул, зМРЦ, Параметры.СкладUUID);
        Если РезОтвет.Результат Тогда
            Остаток = РезОтвет.Ответ.Остаток;
            Продажи = РезОтвет.Ответ.Продажа;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Если Параметры.Свойство("АвтоТест") Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьРеквизитыФормы();

    НастроитьФормуПоЗначениямНастроек();

    ОформитьСтатичныеЗаголовкиИПоля();
	
	// ОриентацияЭкрана
    НастроитьФормуПоОриентацииЭкрана();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

    ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
#Если МобильноеПриложениеКлиент Тогда
    ПодключитьОбработчикОжидания("ВключитьРедактированиеЭлемента", 0.01, Истина);
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ВключитьРедактированиеЭлемента()

#Если МобильноеПриложениеКлиент Или МобильныйКлиент Тогда
     НачатьРедактированиеЭлемента();
#КонецЕсли
КонецПроцедуры
&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
    ПриИзмененииПараметровЭкранаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Сообщить(ИмяСобытия);

    Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда

        НастроитьФормуПоЗначениямНастроек();
		
//	ИначеЕсли ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда

    ИначеЕсли ИмяСобытия = "KeyPress" И ВводДоступен() Тогда
        нПарам =  НРег(Параметр);

        Если нПарам = "enter" И ПозицияВвода = 1 Тогда
            Если Не ЕстьНомерСтрокиДок Тогда
                Готово(Неопределено);
            Иначе
                ПозицияВвода = 2;
            КонецЕсли;
            Возврат;

        КонецЕсли;

        Если нПарам = "enter" И ПозицияВвода = 2 Тогда

            Готово(Неопределено);
            Возврат;
        КонецЕсли;
        Если нПарам = "scan:11" Тогда
            нПарам = "0";
        КонецЕсли;
		
		//Сообщить("Позиция "+ПозицияВвода);
        Если ПозицияВвода = 2 Тогда

            тЧислоСтрокой = Формат(Количество, "ЧЦ=10; ЧГ=");
            Если нПарам = "bksp" Тогда
                н = СтрДлина(тЧислоСтрокой);
                Если н = 0 Или н = 1 Тогда
                    Количество = 0;
                Иначе
                    нч =   Лев(тЧислоСтрокой, н - 1);
                    Количество = Число(нч);
                КонецЕсли;
            Иначе
                Попытка
                    Количество = Число(тЧислоСтрокой + Строка(нПарам));
                Исключение
                КонецПопытки;
            КонецЕсли;
			//Сообщить("Позиция 2 ,парам "+нПарам);
        ИначеЕсли ПозицияВвода = 1 Тогда
            тЧислоСтрокой = Формат(НомерСтрокиДокумента, "ЧЦ=10; ЧГ=");
            Если нПарам = "bksp" Тогда
                н = СтрДлина(тЧислоСтрокой);
                Если н = 0 Или н = 1 Тогда
                    НомерСтрокиДокумента = 0;
                Иначе
                    нч =   Лев(тЧислоСтрокой, н - 1);
                    НомерСтрокиДокумента = Число(нч);
                КонецЕсли;
            Иначе
                Попытка
                    НомерСтрокиДокумента = Число(тЧислоСтрокой + Строка(нПарам));
                Исключение
                КонецПопытки;
            КонецЕсли;
			//Сообщить("Позиция 1 ,парам "+нПарам);

        КонецЕсли;

    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьСтроку(Команда)

    ПараметрыЗакрытия = Новый Структура;
    ПараметрыЗакрытия.Вставить("УдалитьСтроку");

    Закрыть(ПараметрыЗакрытия);

КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
    ПровертьЗакрытиеФормы();
КонецПроцедуры

&НаКлиенте
Процедура СканироватьШтрихкод(Команда)

    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
    ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");

    ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОформитьСтатичныеЗаголовкиИПоля()
	
	// заголовок формы
    ЗаголовокФормы = НСтр("ru = 'Строка №%НомерСтроки%'");
    ЗаголовокФормы = СтрЗаменить(ЗаголовокФормы, "%НомерСтроки%", НомерСтроки);
    Заголовок      = ЗаголовокФормы;
	
	// количество
    ЗаголовокКоличества =  НСтр("ru = 'Количество, %ЕдИзм%'");
    ЗаголовокКоличества = СтрЗаменить(ЗаголовокКоличества, "%ЕдИзм%", НаименованиеЕденицы);
    Элементы.Количество.Заголовок = ЗаголовокКоличества;
    Если ТолькоПросмотрФормы Тогда
        Элементы.Отмена.Заголовок = НСтр("ru = 'Закрыть'");
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Готово, УдалитьСтроку", "Видимость",
            Ложь);

        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Количество", "КнопкаРегулирования",
            Ложь);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Количество", "ТолькоПросмотр", Истина);

    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "МаксимальноеКоличествоИнфо", "Видимость",
        Параметры.Свойство("МаксимальноеКоличествоИнфо"));
    ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "МаксимальноеКоличествоИнфо");
	
	//ИсключенныеСвойства = "ЗакрыватьПриВыборе, ЗакрыватьПриЗакрытииВладельца, ТолькоПросмотр,НаименованиеТовара";
	//ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, ,ИсключенныеСвойства);

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "КоличествоОжидаемое", "Видимость",
        Параметры.Свойство("КоличествоОжидаемое") Или Параметры.Свойство("КоличествоПоставщика"));
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Продажи", "Видимость", Параметры.Свойство(
        "Продажи"));
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Остаток", "Видимость", Параметры.Свойство(
        "Остаток"));
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "НомерСтрокиДокумента", "Видимость",
        Параметры.Свойство("НомерСтрокиДокумента"));

    Если ХозОперация = "ПеремещениеТоваровИзФилиала" Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "УдалитьСтроку", "Видимость", Ложь);

    ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация")
        Или ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД") Или ТипДокумента
        = ПредопределенноеЗначение("Справочник.ТипыДокументов.Инвентаризация") Или ТипДокумента
        = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН") Или ТипДокумента = ПредопределенноеЗначение(
        "Справочник.ТипыДокументов.ЗаданиеТНП") Или ТипДокумента = ПредопределенноеЗначение(
        "Справочник.ТипыДокументов.Zak") Или ТипДокумента = ПредопределенноеЗначение(
        "Справочник.ТипыДокументов.Контролер") Тогда

        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "УдалитьСтроку", "Видимость", Ложь);
    ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
            "КоличествоОжидаемое,Продажи,Количество,УдалитьСтроку", "Видимость", Ложь);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СканированиеЦенник,СканированиеТовар",
            "Видимость", Истина);
    ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
            "КоличествоОжидаемое,Продажи,Количество,УдалитьСтроку", "Видимость", Ложь);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
            "СканированиеЦенник,СканированиеТовар,ГруппаВФ", "Видимость", Истина);
    ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемPKG") Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "УдалитьСтроку", "Видимость", Ложь);
    ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица") Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПересорт", "Видимость", Истина);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "КоличествоОжидаемое", "Видимость",
            Ложь);
    Иначе
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "УдалитьСтроку", "ЦветРамки",
            ЦветаСтиля.ЦветФонаФормы);
    КонецЕсли;
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПриемДо", "Видимость", ЗначениеЗаполнено(
        ПриемДо));
    ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
	//Элементы.Количество.УстановитьГраницыВыделения(СтрДлина(Элементы.Количество),СтрДлина(Элементы.Количество)+1);
    Элементы.Количество.АктивизироватьПоУмолчанию = Истина;

    ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
    ОбщегоНазначения.ОформитьКоличественныеПоляВвода(ЭтаФорма,
        "КоличествоОжидаемое,Продажи,Остаток,Количество,СканированиеТовар", Весовой);
//	Количество = Формат(Число(Количество), ?(Весовой,"ЧЦ=15; ЧДЦ=3; ЧН=","ЧРД=."));

    ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтаФорма, , "Номенклатура");
КонецПроцедуры
#КонецОбласти

#Область ОриентацияЭкрана

&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()

    ОбщегоНазначения.УстановитьОриентациюЭкрана();
    НастроитьФормуПоОриентацииЭкрана();

КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
	//Если ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана Тогда
	//	
	//	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Количество, Штрихкод", "ПоложениеЗаголовка", 
	//	//	ПоложениеЗаголовкаЭлементаФормы.Лево);
	//		
	////	Элементы.ГруппаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	//	
	//	//Элементы.СканироватьШтрихкод.Высота = 1;
	//Иначе
	//	//
	//	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Количество, Штрихкод", "ПоложениеЗаголовка", 
	//	//	ПоложениеЗаголовкаЭлементаФормы.Верх);
	//	//	
	//	//Элементы.ГруппаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//	//Элементы.СканироватьШтрихкод.Высота = 2;
	//КонецЕсли;

КонецПроцедуры
#КонецОбласти

&НаКлиенте
Функция пЗакрытия()
    СтруктураВозврат = Новый Структура;
    СтруктураВозврат.Вставить("Сохранить");
    СтруктураВозврат.Вставить("Пересчет", Истина);

    СтруктураВозврат.Вставить("НомерСтрокиДокумента", НомерСтрокиДокумента);

    Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
        СтруктураВозврат.Вставить("КоличествоВведено", Количество);
        СтруктураВозврат.Вставить("ПричинаРасхожденияПорядок", ?(КоличествоОжидаемое = Количество, "2", ""));
        СтруктураВозврат.Вставить("КоличествоРасхождение", КоличествоОжидаемое - Количество);
    ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда

        СтруктураВозврат = Новый Структура;
    ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") Тогда
        СтруктураВозврат.Вставить("СканированиеТовар", СканированиеТовар);
        СтруктураВозврат.Вставить("Остаток", Остаток);
        СтруктураВозврат.Вставить("Продажи", Продажи);
    ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемPKG") Тогда

        СтруктураВозврат.Вставить("КоличествоВведено", Количество);
        СтруктураВозврат.Вставить("КоличествоРасхождение", КоличествоОжидаемое - Количество);

    Иначе
        КоличествоБаз = Количество * Коэффициент;
        СтруктураВозврат.Вставить("Количество", КоличествоБаз);

        Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД") Или ТипДокумента
            = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") Тогда
            СтруктураВозврат.Вставить("КоличествоВведено", Количество);
        КонецЕсли;
        Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН") Или ТипДокумента
            = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация") Тогда
            СтруктураВозврат.Вставить("Остаток", Остаток);
            СтруктураВозврат.Вставить("Продажи", Продажи);
            СтруктураВозврат.Вставить("КоличествоВведено", КоличествоБаз);
        КонецЕсли;
    КонецЕсли;
    Возврат СтруктураВозврат;
КонецФункции
&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
КонецПроцедуры

&НаКлиенте
Процедура НомерСтрокиДокументаПриИзменении(Элемент)
    Попытка
        НомерСтрокиДокумента = Формат(Число(НомерСтрокиДокумента), "ЧЦ=10");
    Исключение
        Количество = 0;
    КонецПопытки;
    ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
#Если МобильноеПриложениеКлиент Тогда
    НачатьРедактированиеЭлемента();
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПровертьЗакрытиеФормы()

    Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
        Если Количество > КоличествоОжидаемое Тогда
            Сообщить("Введено: " + Формат(Количество, "ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=") + Символы.ПС + " в Резерве: " + Формат(
                КоличествоОжидаемое, "ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ="), СтатусСообщения.ОченьВажное);

            Возврат;
        КонецЕсли;
    ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемPKG") Тогда
        Если Количество > КоличествоОжидаемое Тогда
            Сообщить("Можна прийняти: " + Формат(КоличествоОжидаемое, "ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=") + Символы.ПС
                + " введено " + Формат(Количество, "ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ="), СтатусСообщения.ОченьВажное);

            Возврат;
        КонецЕсли;
    КонецЕсли;

    ПараметрыЗакрытия = пЗакрытия();

    Закрыть(ПараметрыЗакрытия);

КонецПроцедуры
&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
    Попытка
        Количество = Формат(Число(Количество), "ЧЦ=15; ЧДЦ=3");
        ЭтаФорма.ТекущийЭлемент  = Элементы.Готово;

    Исключение
        Количество = 0;
    КонецПопытки;
    ПодключитьОбработчикОжидания("ПровертьЗакрытиеФормы", 0.01, Истина);

КонецПроцедуры

&НаКлиенте
Процедура СканированиеТоварПриИзменении(Элемент)

    Попытка
        Количество = Формат(Число(СканированиеТовар), "ЧЦ=15; ЧДЦ=3");
        ЭтаФорма.ТекущийЭлемент  = Элементы.Готово;

    Исключение
        Количество = 0;
    КонецПопытки;

    ПодключитьОбработчикОжидания("ПровертьЗакрытиеФормы", 0.01, Истина);

КонецПроцедуры
&НаКлиенте
Процедура КоличествоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

    ЭтаФорма.ТекущийЭлемент = Элементы.Количество;

КонецПроцедуры

&НаКлиенте
Процедура НомерСтрокиДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

    ЭтаФорма.ТекущийЭлемент = Элементы.НомерСтрокиДокумента;

КонецПроцедуры
